{
    "name": "João Gabriel de Medeiros Pereira",
    "role": "Software Developer",
    "introduction": "With over 20 years of experience as a Software Developer, I have led the development of the IRATI web application in SALUD GN. Additionally, I have been part of the team responsible for migrating IRATI to a more advanced technology, which has improved its performance and scalability. I am currently focused on my career towards the development of applications for iOS and VisionOS, using Swift both on the client and server side, seeking new challenges in these emerging areas.",
    "languages": [
        {
            "language": "Spanish",
            "level": "Native"
        },
        {
            "language": "English",
            "level": "A2"
        }
    ],
    "jobs": [
        {
            "title": "Bilbomatica - Salud Gobierno de Navarra",
            "role": "Technical Lead",
            "place": "Pamplona, Spain",
            "interval": "April 2010–May 2024",
            "responsabilities": [
                "Maintenance, development, analysis, and evolution of the Irati web application (Nursing Care).",
                "Migrated from Visual Basic to C# using MVC architecture, improving scalability and performance.",
                "Maintained and migrated SQL Server database, optimizing efficiency.",
                "Managed and automated deployments through continuous integration for faster, higher-quality deliveries.",
                "Maintained and evolved APIs to ensure efficient communication with other systems and services."
            ],
            "tecnologies": [
                "SQL Server",
                "Oracle",
                ".Net",
                "C#",
                "Visual Basic",
                "HTML",
                "CSS",
                "JavaScript",
                "JQuery"
            ]
        },
        {
            "title": "Wairbut - Infodesa - Duna (Caja de ahorros de Navarra)",
            "role": "Software Analyst",
            "place": "Pamplona, Spain",
            "interval": "March 2005–April 2010",
            "responsabilities": [
                "Management and administration of the Oracle-based Datawarehouse environment.",
                "Planning and execution of Unix scripts with SQL instructions for table loading in Oracle.",
                "Optimization of process performance and continuous improvement of operational efficiency.",
                "Creation and development of new projects focused on the analysis and improvement of the informational environment.",
                "Resolution of technical incidents in the system, ensuring service stability and continuity.",
                "Maintenance of batch processes in Cobol on the host for data loading and unloading.",
                "Creation of customized reports for different departments, meeting the specific needs of each area."
            ],
            "tecnologies": [
                "Oracle",
                "Teradata",
                "Cobol",
                "Unix"
            ]
        }
    ],
    "education": [
        {
            "title": "APPLE CODING ACADEMY",
            "role": "Swift Refresh Workshop",
            "place": "Spain",
            "interval": "December 2024",
            "responsabilities": [
                "During this course, I updated my skills with the latest advancements introduced by Apple, gaining hands-on experience with cutting-edge technologies such as Swift 6, Swift Data, and Swift Testing. I delved into the use of macros to optimize development and mastered Swift’s strict concurrency model to ensure safe and efficient execution of asynchronous operations. This learning enhances my ability to design modern, scalable solutions aligned with best practices within the Apple ecosystem."
            ],
            "tecnologies": [
                "Swift 6",
                "Swift Data",
                "Swift Testing",
                "Macros",
                "Strict Concurrency"
            ]
        },
        {
            "title": "APPLE CODING ACADEMY",
            "role": "Vision Developer Program",
            "place": "Spain",
            "interval": "July 2024",
            "responsabilities": [
                "During the course, I gained advanced knowledge in developing applications for 3D and spatial environments with Apple Vision Pro. I learned to integrate immersive technologies, design interactive experiences, and work exclusively with Apple’s native tools, avoiding reliance on third-party libraries.",
                "Additionally, the course reinforced the importance of having the architecture work for the developer, maintaining simplicity and efficiency in the workflow, which aligns perfectly with my professional approach."
            ],
            "tecnologies": [
                "iOS",
                "visionOS",
                "Swift",
                "SwiftUI",
                "MVVM",
                "ARKit",
                "RealityKit"
            ]
        },
        {
            "title": "APPLE CODING ACADEMY",
            "role": "Swift Full Stack Bootcamp",
            "place": "Spain",
            "interval": "February 2024–June 2024",
            "responsabilities": [
                "In the bootcamp, I learned how to develop full-stack applications for the Apple ecosystem, both on the client side and server side using Swift and Vapor. The course covered advanced SwiftUI, design patterns, and the use of SwiftData for data persistence. It also delved into concurrency and asynchrony with Async/Await, optimizing application performance. Best security practices, along with the use of unit and UI testing, ensured robust and scalable development."
            ],
            "tecnologies": [
                "iOS",
                "Swift",
                "Async/Await",
                "MVVM",
                "DocC",
                "SwiftData",
                "Vapor",
                "TDD",
                "Secure Development",
                "Machine Learning"
            ]
        },
        {
            "title": "ARTEAN. CUATROVIENTOS SCOOP",
            "role": "Advanced Diploma in Software Application Development",
            "place": "Pamplona, Spain",
            "interval": "September 1999–June 2001",
            "responsabilities": [
                "Design, analyze, test applications, develop software, and implement systems."
            ],
            "tecnologies": [
                "Acces",
                "Metodoly",
                "Visual Basic",
                "Pascal",
                "Cobol",
                "Html",
                "Css",
                "Asp.net"
            ]
        }
    ],
    "projects": [
        {
            "name": "Portfolio",
            "description": "**Personal web portfolio** made with *Ignite* and *Swift*.",
            "links": [
                {
                    "icon": "github",
                    "description": "GitHub",
                    "link": "https://github.com/jcalderita/portfolio-web-ignite"
                }
            ]
        },
        {
            "name": "Spatial shoes",
            "description": "Practice project for **Apple Vision Pro**, developed with *VisionOS* and *Swift*.",
            "links": [
                {
                    "icon": "github",
                    "description": "GitHub",
                    "link": "https://github.com/jcalderita/spatialshoes-app-vision"
                }
            ]
        }
    ],
    "links": [
        {
            "icon": "linkedin",
            "description": "Linkedin",
            "link": "https://www.linkedin.com/in/jcalderita"
        },
        {
            "icon": "github",
            "description": "GitHub",
            "link": "https://github.com/jcalderita"
        },
        {
            "icon": "twitter-x",
            "description": "X",
            "link": "https://x.com/jcalderita"
        },
        {
            "icon": "discord",
            "description": "Discord",
            "link": "https://discord.com/users/jcalderita"
        },
        {
            "icon": "envelope",
            "description": "Mail",
            "link": "mailto:contacto@jcalderita.com"
        }
    ],
    "footer": "Created with Ignite and Swift."
}
